{"title":"Analyzing Political Polarization: Topic Centrality","slug":"political-topic-centrality-3","emoji":"🏛","blurb":"Extending graph centrality to show how different political messages affect the flow of information. The final part in a series posted on the popular blog Towards Data Science.","type":"bp","tags":["gt"],"link":"<a aria-label='Blog' href='https://towardsdatascience.com/analyzing-political-polarization-topic-centrality-dfc402b9fb1d'>Blog</a>","date":"May 28, 2020","prod":true,"html":"<img src=\"https://cdn-images-1.medium.com/max/6000/1*dlDjeRQMuZoexm-onCcAuw.png\" alt=\"All the tweets of political leaders, and their retweets, leading up to Canada’s 2019 federal election\"><em>All the tweets of political leaders, and their retweets, leading up to Canada’s 2019 federal election</em>\n<p>Alex Pentland, director of MIT’s <a href=\"http://connection.mit.edu/\">Connection Science</a> initiative and former director of the MIT <a href=\"https://www.media.mit.edu/\">Media Lab,</a> argues that information flows across networks in a way very similar to the flu. Those who weren’t previously sick, but are repeatedly exposed to those who are, become increasingly likely to ‘catch it’ and go on to spread it to others. The same goes for ideas. As we are exposed to different viewpoints and perspectives, we have a propensity towards ‘catching’ them, which influences are friends and family (our little part of the larger network). This can go on in a cascading affect that disperses information across the entire network. <strong>In this article we will look at political polarization as a function of the flow of ideas in a network.</strong> Specifically, we will see that depending on what a tweet is about, it can ‘spread’ very differently.</p><p>Some types of tweets spread in very narrow circles, and are only retweeted by the supporters of a party leader. These are what we called <em>bonding messages</em>, as they concentrate the spread of information within a particular group (in this case, the supporters of some political party). Other types of tweets spread across the entire network, as they are retweeted by a more diverse range  of individuals. We called these <em>bridging messages</em>, as they span demographics when spreading information. <strong>If we take the idea that political polarization is fundamentally a lack of empathy for those with different viewpoints, then knowing what types of messages increase the spread of ideas across the political landscape is important.</strong> To do this we will explore and extend the concept of graph centrality; if the word centrality isn’t familiar to you, don’t worry, we’ll start from the ground up.</p><h2 id=\"a-quick-recap\">A Quick Recap</h2>\n<p>As a reminder from my previous articles on <a href=\"https://towardsdatascience.com/analyzing-political-polarization-on-twitter-engagement-graphs-aa0614ed1361\">engagement graphs</a> and <a href=\"https://towardsdatascience.com/analyzing-political-polarization-topic-modelling-65c6d25b2600\">topic modelling,</a> we’re trying to achieve a better understanding of how politically active Twitter users engage  with the different types of messages that party leaders put out. The case study that we’re using is Canada’s 2019 federal election, and all of the English tweets and retweets put out in the preceding year. We created a massive network, seen above, that shows the 5 party leaders, hidden in the center of each cluster; all of the tweets that they put out, colored according to topic; and all of the users who retweeted on of the party leaders tweets. These users are the light-blue vertices. In total we ended up with 7,978 tweets, and 113,293 retweets spread out among 36,450 users.</p><p>Since we’re looking at the bridging or bonding characteristics of different <em>messages</em>, we had to group all of the ~8,000 tweets by topic. To do this we turned to an unsupervised machine learning technique called the latent Dirichlet allocation (LDA). LDAs take in a collection of documents, in this case tweets, and represents each document as some distribution of <em>k</em> topics in a way that best preserves the semantics of the document. In our case, the most performant LDA was able to extract 7 topics from the body of tweets. By assigning each tweet as the topic that it is closest to, each tweet was assigned to one of these 7 topics. To recap, these topics are:</p><ul>\n<li><p>Topic 1: campaign messages, rallies and logistics.</p></li>\n<li><p>Topic 2: carbon taxes, pipelines and the economy.</p></li>\n<li><p>Topic 3: the SNC Lavalin scandal.</p></li>\n<li><p>Topic 4: appeals to the middle-class.</p></li>\n<li><p>Topic 5: celebratory messages, as well as tweets regarding national holidays and days of remembrance.</p></li>\n<li><p>Topic 6: immigration, diversity and free speech.</p></li>\n<li><p>Topic 7: healthcare, abortion and pharmacare.</p></li>\n</ul>\n<h2 id=\"what-is-graph-centrality\">What is Graph Centrality</h2>\n<p>Graph’s are a way of representing relationships, called edges, between various things, called vertices. I’ve been calling the header image a network, which in my opinion is a more intuitive descriptor, but generally in mathematics the network we’ve built would be referred to as a graph. <strong>Measures of graph centrality aim to find important vertices within a graph</strong>. This can be done in a variety of ways; the simplest would be to count the number of edges that each vertex has — and say that the greater number of connections, the higher the centrality score. This is useful in our case because we can then quantify how important tweets of different topics were. But we are going to take a more nuanced approach than just counting the number of retweets per tweet. For this we will look at Eigenvector centrality, which says that it’s not only the number of retweets that matter, but <em>having retweets from really active Twitter users.</em> By expanding this concept we’ll arrive at two variations of topic centrality: one which measures how important a topic was, on average, in the entire network — and one that measures how important a topic was, on average, to a specific party leader. The former is an indicator that the information in those tweets was spread broadly, while the latter indicates a concentration of information.</p><h3 id=\"eigenvector-centrality\">Eigenvector Centrality</h3>\n<p>As Newman lays out in his 2016, Mathematics of Networks:</p><blockquote>\n<p>The eigenvector centrality [. . . ] accords each vertex a centrality  that depends both on the number and the quality of its connections: having a large number of connections still counts for something, but a vertex with a smaller number of high-quality contacts may outrank one with a larger number of mediocre contacts.¹</p></blockquote>\n<p>Similarly  with my <a href=\"https://towardsdatascience.com/analyzing-political-polarization-topic-modelling-65c6d25b2600?source=post_page-----c169a8717ecf----------------------\">article</a> where I discuss the LDA, I don’t want to get bogged down in the math that distracts from what we’re trying to achieve. So for now I will simply define the <strong>eigenvector centrality of vertex <em>i</em> as <em>x<sub>i</sub></em>, where <em>x<sub>i</sub></em> is proportional to the average eigenvector centrality of <em>i</em>’s neighbors.</strong> This way if a tweet vertex is retweeted by <em>highly engaged users</em>, it will have a higher eigenvector centrality. This is important because politically active Twitter  users are more likely to share content, attend a political rally and vote —but more importantly they <em>increase the flow of information in a network.</em></p><h2 id=\"topic-centrality\">Topic Centrality</h2>\n<p>Topic centrality is a new technique that <strong>aggregates the centrality scores for tweets of different topics.</strong> For this study, we’ll say that  messages can serve two purposes: they can bridge communities, and diversify the flow of ideas, or they can bond communities, and concentrate the flow of ideas. In order to quantify this using our network we need two types of topic centrality, one that calculates how important tweets of a particular topic were to the <em>entire network</em> and one that calculates how important tweets of a topic were to <em>a party leader’s base</em>. The former is represented by total network topic centrality, and the latter is represented by party leader topic centrality. By comparing and contrasting the two we can get a full picture of how different topics influenced political discourse.</p><h3 id=\"total-network-topic-centrality\">Total Network Topic Centrality</h3>\n<p>Total network topic centrality is an aggregate of the eigenvector centrality of all tweets of a certain topic in the entire engagement graph. For example, if we’re calculating the total network topic centrality for topic 2 — tweets about a carbon tax —  we would take the entire graph, calculate the eigenvector centrality for all of its vertices, and average the scores of the purple vertices which represent that topic. This is shown below. We can therefore define total network topic centrality for <em>topic v</em> in a <em>graph G</em> as the set below:</p><blockquote>\n<p><em>T<sub>v</sub>:= {x<sub>i</sub>,∀ i ∈ G| type(i) = tweet, topic(i) = v}</em></p></blockquote>\n<img src=\"https://cdn-images-1.medium.com/max/2718/1*LevnO62uPfmzryJEmXz0DA.png\" alt=\"Process for total network topic centrality\"><em>Process for total network topic centrality</em>\n<p>When taking the z-score centrality relative to other topics, a single number can be assigned to the relative importance of topic <em>v</em>.</p><h3 id=\"party-leader-topic-centrality\">Party Leader Topic Centrality</h3>\n<p>In order to measure how central a topic is to a party leader’s base, we needed a measure of  party leader topic centrality. <strong>This assumes a world in which party leader <em>y</em> is the only actor users can engage with.</strong> This done by removing all of the tweets by other party leaders, and all of the users who didn’t retweet something from that party leader, resulting in a subgraph of <em>G</em> which we’ll call <em>G<sub>y</sub></em>.</p><blockquote>\n<p><em>P<sub>vy</sub> := {x<sub>i</sub>,∀ i ∈ G<sub>y</sub> | type(i) = tweet, topic(i) = v}</em></p></blockquote>\n<p>After the subgraph <em>G<sub>y</sub></em> is constructed, the party leader topic centrality <em>P<sub>vy</sub></em> is defined as the set of all eigenvector centrality measures for tweet vertices of topic <em>v</em> in <em>G<sub>y</sub></em>. The process for calculating Justin Trudeau’s party leader topic centrality for topic 4 is visualized in the image below.</p><img src=\"https://cdn-images-1.medium.com/max/4188/1*4Mc1UrGfSNEv0C6SMTPjcw.png\" alt=\"Process for party leader topic centrality\"><em>Process for party leader topic centrality</em>\n<p>Similarly, by taking the z-score of <em>P<sub>vy</sub></em> relative to the other topics that party leader promoted, a single centrality score can be assigned that measures how important topic <em>v</em> was to those who engaged with party leader <em>y</em>. This will be higher if it: has a high number of retweets and is retweeted by y’s <em>most engaged followers</em>. Highly active users who rarely engage with that specific party leader are discounted in this metric relative to someone who is less engaged, but concentrates their attention on that party leader’s content.</p><h3 id=\"putting-everything-together\">Putting everything together</h3>\n<img src=\"https://cdn-images-1.medium.com/max/2702/1*Shtw4hfWYbRB6b57UCgkwg.png\" alt=\"Tweets by Topic Breakdown\"><em>Tweets by Topic Breakdown</em>\n<p>Previously, we saw how often the party leaders tweeted about certain topics, as indicated by the chart above. The below chart shows how effective the party leaders were at either: concentrating information among their supporters, or taking advantage of topics that spread information throughout Twitter. The horizontal axis represents party leader topic centrality, and the vertical axis represents total network topic centrality. Since every topic, regardless of the party leader, has the same total network topic centrality score — all points of the same topic lie on the same point vertically. Each point is colored according to the party leader and annotated with its topic.</p><img src=\"https://cdn-images-1.medium.com/max/2000/1*Vk_kNzFuCtqwDnbedBaBsA.png\" alt=\"Total network vs party leader topic centrality\"><em>Total network vs party leader topic centrality</em>\n<p>What can we tell from this? For starters, while Maxime Bernier had almost 4.5x as many tweets about immigration (topic 6) as the other 4 candidates combined, these tweets had the lowest overall total network topic centrality and had his lowest party leader topic centrality.  Also, despite tweets pertaining to health care and pharmacare (topic 7) only making up 1% of all tweets, and their low total network centrality score, they had the highest engagement among Justin Trudeau’s supporters.</p><p>What else can we do with this information? <strong>If we take a step back from the party leaders themselves, and average the party leader topic centrality scores by topic, we can get an idea of how the topics diffused or concentrated information.</strong> This is shown in the chart below.</p><img src=\"https://cdn-images-1.medium.com/max/2000/1*G38QOj9lch_DjrEFjYGuqw.png\" alt=\"Total network vs party leader topic centrality (averaged by topic)\"><em>Total network vs party leader topic centrality (averaged by topic)</em>\n<p>Here it is interesting to look at the lower right-hand and upper left-hand quadrants. The former indicates topics that are more important to a party leader’s base than to the entire network (topics 7, 4 and 1). Topic 1 — campaign messages— intuitively makes sense in this category; it is not surprising that messages about the campaign, where rallies are, <em>etc.</em> would be most important to a party leader’s base. Conversely, tweets in the upper left-hand quadrant indicates tweet topics that are more important to the overall network than to the individual network — which may be an indication of those topics spanning partisan divides (topics 2 and 3).</p><h2 id=\"so-what\">So what</h2>\n<p>This series of posts has been a way to distribute my article, <em><a href=\"https://github.com/cameron-raymond/CISC500-SeniorThesis/raw/master/topic_centrality_paper/Measures_of_Topic_Centrality_for_Online_Political_Engagement.pdf\">Bridging or Bonding? Measures of Topic Centrality for Online Political Engagement</a></em>, to a wider audience. I spent my time writing these posts because these methods and statistics can uncover interesting facts about our political landscape in ways that are easily overlooked by existing models of political communication. They demonstrate statistically significant results that both the producer of the content <em>and the content itself</em>, are crucial in understanding how social media modulates political discourse and engagement. At a more granular level, it allows for the investigation, and confirmation, that certain messages are more important to the overall network, and certain messages are more important to individual party leaders’ bases. The key insight is that <strong>these two categories do not necessarily overlap</strong>. The topics that informed individuals of party events and campaign information, as well as appeals to individuals economic worries (topics 1 and 4 respectively) tended to drive engagement among a party leader’s supporters, but had less influence on the overall discourse. Conversely, issues that were pervasive in the public discourse, like the SNC Lavalin affair and discussion of a carbon tax, translated into the digital realm as well — and tended to be more important to the overall discourse. While all party leaders touched on these big “dinner table” topics, and presumably had differing stances on them, they were not the sole preserve of any one party. As a result engagement was more likely to cross party lines.</p><p>Returning back to our loose analogy between bridging and bonding social capital, and bridging and bonding messages. In an era that is characterized by a heightened sense of political polarization, it is useful to know how different types of messaging provoke different forms of political engagement¹. It is interesting to note that engagement surrounding policy issues like healthcare, while important, were often confined to the bubble of a political leader. Bonding social capital reinforces identities, and mobilizes solidarity — from a theoretical standpoint, it stands to reason that bonding messages may serve similar purposes². Bonding messages, in this case, concentrated the flow of information among a party leader’s supporters. Bridging messages, like bridging social capital, bring along weak ties, and diffuse information to a larger network of individuals. This can increase the diversity of information that people are exposed to, and has the potential to break down echo chambers.</p><p>And yet, more work needs to be done.</p><p>Even if a more diverse group of  people saw and engaged with tweets about carbon taxes, pipelines, and the SNC Lavalin scandal, that doesn’t mean that those people were learning from each other. In fact, if users were retweeting these comments but it lead to online conflict, then there could be negative consequences for political polarization. So while it is clear that you can affect the spread of information by controlling what you tweet, it is not clear how to best take advantage of this to bridge divides. However, this starting point is helpful in-and-of-itself, as <strong>there’s no point in having the right message, if the wrong people see it.</strong></p><p>Thanks for sticking around for this series. I&#39;ve had a lot of fun hearing different perspectives on this research and how it could be adapted! If you have thoughts yourself, feel free to reach out to me directly below.</p><p>[1]: Newman, Mark EJ. (2008). The mathematics of networks. <em>The new palgrave encyclopedia of economics</em>, 2(2008), 1–12.</p><p>[2]: Schipper, Burkhard C, &amp; Woo, Hee. (2018). Political awareness, microtargeting of voters, and negative electoral campaigning. <em>Microtargeting of voters, and negative electoral campaigning (september 17, 2018)</em>.</p><p>[3]: Putnam, Robert D. (2000). Bowling alone: America’s declining social capital. <em>Pages 223–234 of: Culture and politics</em>. Springer.</p>"}